<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest SuperDuper! release dmg, determines version, verifies Code Signature and then copies the .app to /Applications.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.install.SuperDuper</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuperDuper!</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.SuperDuper</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>destination_path</key>
				<string>/Applications/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
