<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest SuperDuper! release dmg, determines version, verifies Code Signature and then imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.munki.SuperDuper</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>SuperDuper is the wildly acclaimed program that makes recovery painless, because it makes creating a fully bootable backup painless. Its incredibly clear, friendly interface is understandable, easy to use, and SuperDuper's built-in scheduler makes it trivial to back up automatically. It's the perfect complement to Time Machine, allowing you to store a bootable backup alongside your Time Machine volume—and it runs beautifully on your Mac!

SuperDuper's interface confirms all your actions in simple, clear language to ensure that the end result is exactly what you intended.

We all know that using the Macintosh is usually a trouble-free experience.

Except when it's not. Like when:

Your hard drive starts making that horrible clicking noise that signals an imminent meltdown
A momentary lapse of coordination causes your MacBook Pro to take a dirt nap
The system suddenly fails to boot
Your most important day-to-day application isn't working with the system update you just applied
The new driver you just updated is causing your Macintosh to crash
That lousy software you just tried didn't come with an uninstaller, and scattered files all over your drive
You need to restore a stable copy of your system, but don't want to lose what you've been working on
You need to test new versions of the operating system with production data you can't afford to lose
It happens to all of us, eventually. And recovering can be a painful, error-prone, time-wasting experience, if it's even possible at all. Until now.
			</string>
			<key>display_name</key>
			<string>%NAME%!</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.SuperDuper</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
