<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OSXFUSE release dmg from SourceForge and then imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.munki.OSXFUSE</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OSXFUSE</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>FUSE for OS X allows you to extend OS X's native file handling capabilities via third-party file systems. OSXFUSE is a successor to MacFUSE, which has been used as a software building block by dozens of products, but is no longer being maintained.

Features

As a user, installing the OSXFUSE software package will let you use any third-party file system written atop OSXFUSE or MacFUSE, if you choose to install the MacFUSE compatibility layer.

As a developer, you can use the OSXFUSE SDK to write numerous types of new file systems as regular user space programs. The content of these file systems can come from anywhere: from the local disk, from across the network, from memory, or any other combination of sources. Writing a file system using OSXFUSE is orders of magnitude easier and quicker than the traditional approach of writing in-kernel file systems. Since OSXFUSE file systems are regular applications (as opposed to kernel extensions), you have just as much flexibility and choice in programming tools, debuggers, and libraries as you have if you were developing standard OS X applications.

How It Works

In more technical terms, OSXFUSE implements a mechanism that makes it possible to implement a fully functional file system in a user-space program on OS X. It provides multiple APIs, one of which is a superset of the FUSE API (file system in user space) that originated on Linux. Therefore, many existing FUSE file systems become readily usable on OS X.

The OSXFUSE software consists of a kernel extension and various user space libraries and tools. It comes with C-based and Objective-C-based SDKs. If you prefer another language (say, Python or Java), you should be able to create file systems in those languages after you install the relevant language bindings yourself.

The filesystems repository contains source code for several exciting and useful file systems for you to browse, compile, and build upon, such as sshfs, procfs, AccessibilityFS, GrabFS, LoopbackFS, SpotlightFS, and YouTubeFS.

Why choose OSXFUSE?

OSXFUSE is a successor to MacFUSE, which has been unmaintained since 2009. It shares most of its source code with MacFUSE.
OSXFUSE features a compatibility mode for file systems that have been built for MacFUSE. It can be a drop-in replacement for MacFUSE.
OSXFUSE supports Mac OS X 10.5 and later (Intel and PowerPC architecture). It is fully compatible with 64-bit kernels and OS X 10.7.
OSXFUSE is open source and under active development.
			</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>installs</key>
			<array>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>com.github.osxfuse.OSXFUSEPrefPane</string>
					<key>path</key>
					<string>/Library/PreferencePanes/OSXFUSE.prefPane</string>
					<key>type</key>
					<string>bundle</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.OSXFUSE</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
