<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OSXFUSE release dmg from SourceForge.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.OSXFUSE</string>
	<key>Input</key>
	<dict>
		<key>FEED_URL</key>
		<string>https://osxfuse.github.io/</string>
		<key>SEARCH_PATTERN</key>
		<string>osxfuse-[0-9]\.[0-9]\.[0-9]</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FEED_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://sourceforge.net/projects/osxfuse/files/%match%/%match%.dmg/download</string>
				<key>filename</key>
				<string>%match%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
