<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Intel Power Gadget Studio release, unzips the dmg and copies out the pkg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.pkg.IntelPowerGadget</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Intel Power Gadget</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.IntelPowerGadget</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/IntelÆ Power Gadget.dmg/Install %NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Install %NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
