<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Intel Power Gadget Studio release and unzips the dmg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.IntelPowerGadget</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Intel Power Gadget</string>
		<key>BASE_URL</key>
		<string>https://software.intel.com/sites/default/files</string>
		<key>FEED_URL</key>
		<string>https://software.intel.com/en-us/articles/intel-power-gadget-20</string>
		<key>SEARCH_PATTERN</key>
		<string>managed/../../IntelPowerGadgetMac.*?\.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FEED_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%BASE_URL%/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_format</key>
				<string>zip</string>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
