<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ZTerm release dmg and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.munki.ZTerm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ZTerm</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>ZTerm</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>ZTerm is a terminal emulation program for the Macintosh. In its day, many people used it to connect to Bulletin Board Systems and download files. Now we have the internet. Its still a useful utility for those systems that only offer dialup connections and for connecting to devices through a serial port, like many routers. For newer Macintoshs that don't have a normal serial port, ZTerm can talk to ports on USB to serial adapters, through the appropriate driver software supplied with the adapter.</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.4.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.ZTerm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--pkgvers=%match%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
