<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ZTerm release dmg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.ZTerm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ZTerm</string>
		<key>FEED_URL</key>
		<string>http://www.dalverson.com/zterm</string>
		<key>SEARCH_PATTERN</key>
		<string>ZTerm (\d\.\d)</string>
		<!-- string>ZTerm\d\.\d\.dmg</string -->
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FEED_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%FEED_URL%/%NAME%%match%.dmg</string>
				<!-- string>%FEED_URL%/%match%</string -->
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<!-- dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict -->
	</array>
</dict>
</plist>
