<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TotalSpaces2 release using their Sparkle feed, and verifies the Code Signature.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.TotalSpaces2</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Input</key>
	<dict>
		<key>APP</key>
		<string>TotalSpaces2.app</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://updates-s3.binaryage.com/totalspaces2.xml</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%APP%/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%APP%</string>
				<key>requirement</key>
				<string>identifier "com.binaryage.TotalSpaces2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ATQ7JK2L54</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
