<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TotalSpaces2 release using their Sparkle feed, verifies the Code Signature and then imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.munki.TotalSpaces2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TotalSpaces2</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>BinaryAge</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Navigate OSX desktops as if they were a 2D grid of spaces, TotalSpaces2 is the ultimate grid spaces manager for your Mac.
	
Features:
	•Manage your desktops
	•Define your grid
	•Copy your transitions
	•Swipe between desktops
	•Hotcorners
	•App assignments
			</string>
			<key>display_name</key>
			<string>TotalSpaces2</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.TotalSpaces2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>TotalSpaces2.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
