<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TotalSpaces2 release using their Sparkle feed and then installs via that dmg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.install.TotalSpaces2</string>
	<key>Input</key>
	<dict>
		<key>APP</key>
		<string>TotalSpaces2.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.pkg.TotalSpaces2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%APP%</string>
				<key>destination_path</key>
				<string>/Applications/%APP%</string>
				<key>overwrite</key>
				<false/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
