<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OBS Studio release dmg from GitHub and copies the pkgs out from the mpkg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.pkg.OBS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OBS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.OBS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%*.mpkg/Contents/Packages/%NAME%*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%*.mpkg/Contents/Packages/SyphonInject.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/SyphonInject.pkg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
