<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Asepsis release dmg using their Sparkle feed and then imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.munki.Asepsis</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Asepsis</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>BinaryAge</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Asepsis is a system utility for prevention of .DS_Store files.</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

/usr/local/bin/asepsisctl enable
logger "munki -- Asepsis enabled"

/usr/local/bin/asepsisctl migratein
logger "munki -- Asepsis migration completed"
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.Asepsis</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_pkgname</key>
				<string>%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
