<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Asepsis release dmg using their Sparkle feed.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.Asepsis</string>
	<key>Input</key>
	<dict>
		<key>APP_PATH</key>
		<string>Library/Application Support/%NAME%/%NAME%Updater.app</string>
		<key>NAME</key>
		<string>Asepsis</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://updates-s3.binaryage.com/asepsis.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
