<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Asepsis release using their Sparkle feed, and copies out the pkg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.pkg.Asepsis</string>
	<key>Input</key>
	<dict>
		<key>APP</key>
		<string>%NAME%.app</string>
		<key>NAME</key>
		<string>Asepsis</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.download.Asepsis</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>overwrite</key>
				<false/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
