<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Dash release using their Sparkle feed.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.download.Dash</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dash</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://kapeli.com/Dash.xml</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>http://kapeli.com/Dash.xml</string>
				<key>appcast_query_pairs</key>
				<dict>
					<key>appName</key>
					<string>Dash</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.kapeli.dash" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S6W832GPM5)</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
