<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Dash release using their Sparkle feed, builds a pkg and then installs via that pkg.</string>
	<key>Identifier</key>
	<string>com.github.ninjabong.install.Dash</string>
	<key>Input</key>
	<dict>
		<key>Name</key>
		<string>Dash</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ninjabong.pkg.Dash</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
